app/controllers/data_snippets_controller.rb

  def index
    @data_snippets = DataSnippet.all
---
SELECT * FROM `data_snippets`

  def show
    @data_snippet = DataSnippet.find(params[:id])
---
SELECT * FROM `data_snippets` WHERE (`data_snippets`.`id` = 1)

  def create
    @data_snippet = DataSnippet.new(params[:data_snippet])

    respond_to do |format|
      if @data_snippet.save
---
INSERT INTO `data_snippets` (`created_at`, `body`, `updated_at`) VALUES('2009-11-04 11:28:43', '[\"@ey-sort\", \"@ey-firsthalf\", \"@ey-firsthalf\", \"@engineyard\"]', '2009-11-04 11:28:43')